org/articles/animetranshumanism.org
#+TITLE: Anime and Transhumanism

* A History of Transhumanist Themes in Anime and Manga

** Anime

ghost in the shell, nge, serial experiments lain, psycho pass, texhnolyze, ergo proxy, steins;gate, akira, apleseed, metropolis, paprika, bubblegum crisis

some thoughts on jujutsu kaisen

astro boy, early work on artificial intelligence

8 man, cyborg 009

jjk geto and tsukumo on humanity's potential

** Other works on this link

Metamodernity, American Transcendentalism and Transhumanism in Japanese Anime https://philarchive.org/archive/FOEMAT-2

When the machines stop: Fantasy, reality, and terminal identity in Neon Genesis Evangelion and Serial Experiments Lain https://www.researchgate.net/publication/294741379_When_the_machines_stop_Fantasy_reality_and_terminal_identity_in_Neon_Genesis_Evangelion_and_Serial_Experiments_Lain

Anime, Philosophy, and Religion https://vernonpress.com/file/21868/3a392c5dd3d6382a446d47fc3ad92351/1696328632.pdf

Chapter 6: Where is the Real Me? Encountering Transhumanism and Cybernetic Divinity in /Serial Experiments Lain/

** Japanese cultural ties

Shinto and the Spirituality of Objects

Buddhism - Impermanence, non-self, fusion of technology and spirituality

Balance with nature -- technology /is/ nature, it /is/ the surrounding world.

Books on shinto in general:

Shinto for the Cultured (how shinto formed the spiritual culture of modern japanese society)

Shinto: A history (comprehensive history of shinto)

Taoism, Shintoism, and the Ethics of Technology: An Ecocritical Review of Howl's Moving Castle https://www.researchgate.net/publication/304213267_Taoism_Shintoism_and_the_Ethics_of_Technology_An_Ecocritical_Review_of_Howl's_Moving_Castle

Techno-animism in Japan: Shinto Cosmograms, Actor-network Theory, and the Enabling Powers of Non-human Agencies https://journals.sagepub.com/doi/full/10.1177/0263276412456564

Through the Looking Glass: Ghost in the Shell, transhumanism, and transcendence through the virutal https://repository.canterbury.ac.uk/item/8w36z/through-the-looking-glass-ghost-in-the-shell-transhumanism-and-transcendence-through-the-virtual

** Overcoming Your Own Humanity

Everything possesses a spirit (kami) not just deities and humans.

Bushido and the journey for perfection, a cultural emphasis on self-betterment

** Interviews with Mangaka

https://nerdist.com/article/anime-101-meet-the-god-of-manga/

https://tezukaosamu.net/en/other/6.html

https://tezukainenglish.com/wp/?page_id=1518

https://www.youtube.com/watch?v=uipZoRO4tYg#:~:text=URL%3A%20https%3A%2F%2Fwww,com%E3%80%91%0A%0A%C2%A9%202024%20Google%20LLC

https://www.youtube.com/watch?v=yKC0blzaby0#:~:text=URL%3A%20https%3A%2F%2Fwww,com%E3%80%91%0A%0A%C2%A9%202024%20Google%20LLC


