articles/animetranshumanism.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-30 Tue 22:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Anime and Transhumanism</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</a></li>
            <li class="dark-mode-nav-item"><a href="#" class="dark-mode-toggle-nav" onclick="toggleDarkMode(); return false;">🌙</a></li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Anime and Transhumanism</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2857afb">A History of Transhumanist Themes in Anime and Manga</a>
<ul>
<li><a href="#orgaf5161c">Anime</a></li>
<li><a href="#org2ea1beb">Other works on this link</a></li>
<li><a href="#org46c422c">Japanese cultural ties</a></li>
<li><a href="#org0ea4b10">Overcoming Your Own Humanity</a></li>
<li><a href="#org9e0d167">Interviews with Mangaka</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2857afb" class="outline-1">
<h1 id="org2857afb">A History of Transhumanist Themes in Anime and Manga</h1>
<div class="outline-text-1" id="text-org2857afb">
</div>
<div id="outline-container-orgaf5161c" class="outline-2">
<h2 id="orgaf5161c">Anime</h2>
<div class="outline-text-2" id="text-orgaf5161c">
<p>
ghost in the shell, nge, serial experiments lain, psycho pass, texhnolyze, ergo proxy, steins;gate, akira, apleseed, metropolis, paprika, bubblegum crisis
</p>

<p>
some thoughts on jujutsu kaisen
</p>

<p>
astro boy, early work on artificial intelligence
</p>

<p>
8 man, cyborg 009
</p>

<p>
jjk geto and tsukumo on humanity's potential
</p>
</div>
</div>

<div id="outline-container-org2ea1beb" class="outline-2">
<h2 id="org2ea1beb">Other works on this link</h2>
<div class="outline-text-2" id="text-org2ea1beb">
<p>
Metamodernity, American Transcendentalism and Transhumanism in Japanese Anime <a href="https://philarchive.org/archive/FOEMAT-2">https://philarchive.org/archive/FOEMAT-2</a>
</p>

<p>
When the machines stop: Fantasy, reality, and terminal identity in Neon Genesis Evangelion and Serial Experiments Lain <a href="https://www.researchgate.net/publication/294741379_When_the_machines_stop_Fantasy_reality_and_terminal_identity_in_Neon_Genesis_Evangelion_and_Serial_Experiments_Lain">https://www.researchgate.net/publication/294741379_When_the_machines_stop_Fantasy_reality_and_terminal_identity_in_Neon_Genesis_Evangelion_and_Serial_Experiments_Lain</a>
</p>

<p>
Anime, Philosophy, and Religion <a href="https://vernonpress.com/file/21868/3a392c5dd3d6382a446d47fc3ad92351/1696328632.pdf">https://vernonpress.com/file/21868/3a392c5dd3d6382a446d47fc3ad92351/1696328632.pdf</a>
</p>

<p>
Chapter 6: Where is the Real Me? Encountering Transhumanism and Cybernetic Divinity in <i>Serial Experiments Lain</i>
</p>
</div>
</div>

<div id="outline-container-org46c422c" class="outline-2">
<h2 id="org46c422c">Japanese cultural ties</h2>
<div class="outline-text-2" id="text-org46c422c">
<p>
Shinto and the Spirituality of Objects
</p>

<p>
Buddhism - Impermanence, non-self, fusion of technology and spirituality
</p>

<p>
Balance with nature &#x2013; technology <i>is</i> nature, it <i>is</i> the surrounding world.
</p>

<p>
Books on shinto in general:
</p>

<p>
Shinto for the Cultured (how shinto formed the spiritual culture of modern japanese society)
</p>

<p>
Shinto: A history (comprehensive history of shinto)
</p>

<p>
Taoism, Shintoism, and the Ethics of Technology: An Ecocritical Review of Howl's Moving Castle <a href="https://www.researchgate.net/publication/304213267_Taoism_Shintoism_and_the_Ethics_of_Technology_An_Ecocritical_Review_of_Howl's_Moving_Castle">https://www.researchgate.net/publication/304213267_Taoism_Shintoism_and_the_Ethics_of_Technology_An_Ecocritical_Review_of_Howl's_Moving_Castle</a>
</p>

<p>
Techno-animism in Japan: Shinto Cosmograms, Actor-network Theory, and the Enabling Powers of Non-human Agencies <a href="https://journals.sagepub.com/doi/full/10.1177/0263276412456564">https://journals.sagepub.com/doi/full/10.1177/0263276412456564</a>
</p>

<p>
Through the Looking Glass: Ghost in the Shell, transhumanism, and transcendence through the virutal <a href="https://repository.canterbury.ac.uk/item/8w36z/through-the-looking-glass-ghost-in-the-shell-transhumanism-and-transcendence-through-the-virtual">https://repository.canterbury.ac.uk/item/8w36z/through-the-looking-glass-ghost-in-the-shell-transhumanism-and-transcendence-through-the-virtual</a>
</p>
</div>
</div>

<div id="outline-container-org0ea4b10" class="outline-2">
<h2 id="org0ea4b10">Overcoming Your Own Humanity</h2>
<div class="outline-text-2" id="text-org0ea4b10">
<p>
Everything possesses a spirit (kami) not just deities and humans.
</p>

<p>
Bushido and the journey for perfection, a cultural emphasis on self-betterment
</p>
</div>
</div>

<div id="outline-container-org9e0d167" class="outline-2">
<h2 id="org9e0d167">Interviews with Mangaka</h2>
<div class="outline-text-2" id="text-org9e0d167">
<p>
<a href="https://nerdist.com/article/anime-101-meet-the-god-of-manga/">https://nerdist.com/article/anime-101-meet-the-god-of-manga/</a>
</p>

<p>
<a href="https://tezukaosamu.net/en/other/6.html">https://tezukaosamu.net/en/other/6.html</a>
</p>

<p>
<a href="https://tezukainenglish.com/wp/?page_id=1518">https://tezukainenglish.com/wp/?page_id=1518</a>
</p>

<p>
<a href="https://www.youtube.com/watch?v=uipZoRO4tYg#:~:text=URL%3A%20https%3A%2F%2Fwww,com%E3%80%91%0A%0A%C2%A9%202024%20Google%20LLC">https://www.youtube.com/watch?v=uipZoRO4tYg#:~:text=URL%3A%20https%3A%2F%2Fwww,com%E3%80%91%0A%0A%C2%A9%202024%20Google%20LLC</a>
</p>

<p>
<a href="https://www.youtube.com/watch?v=yKC0blzaby0#:~:text=URL%3A%20https%3A%2F%2Fwww,com%E3%80%91%0A%0A%C2%A9%202024%20Google%20LLC">https://www.youtube.com/watch?v=yKC0blzaby0#:~:text=URL%3A%20https%3A%2F%2Fwww,com%E3%80%91%0A%0A%C2%A9%202024%20Google%20LLC</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
